src/cf/InformationRegisters/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСпецификаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпецификацияКДоговору</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СпецификацияКДоговору</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыСпецификаций/Ext/ManagerModule.bsl
Функция ПолучитьСтатусСпецификации(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСпецификаций.Статус
		|ИЗ
		|	РегистрСведений.СтатусыСпецификаций КАК СтатусыСпецификаций
		|ГДЕ
		|	СтатусыСпецификаций.СпецификацияКДоговору = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
	Возврат ВыборкаДетальныеЗаписи.Статус;
	
	Иначе
		
	Возврат Перечисления.СтатусыСпецификаций.НеСогласован;
		
	КонецЕсли;

		
КонецФункции // ПолучитьСтатусСпецификации(Ссылка)()

Процедура УстановитьСтатусСпецификации (Статус, Ссылка) Экспорт

	НаборЗаписей = РегистрыСведений.СтатусыСпецификаций.СоздатьНаборЗаписей();
  	НаборЗаписей.Отбор.СпецификацияКДоговору.Установить(Ссылка);
  	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
	Запись = НаборЗаписей.Добавить();
	Запись.СпецификацияКДоговору = Ссылка;
	Запись.Статус = Статус;
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	Запись = НаборЗаписей[0];
	Запись.Статус = Статус;
	КонецЕсли;
	НаборЗаписей.Записать();

  
КонецПроцедуры
